# SetConstraintValue

## Description
Sets the referenced dimensional constraint to a new value.

```pascal
PROCEDURE SetConstraintValue(
				constraint : HANDLE;
				value      : REAL);
```

```python

def vs.SetConstraintValue(constraint, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|constraint|HANDLE|Handle to constraint being modified.|
|value|REAL|New value for the constraint.|

## Version
Availability: from VectorWorks9.0
## Category
* Parametric Constraints